# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArray..::..ReverseIterator Method
VertexIndexPairArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual VertexIndexPairArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As VertexIndexPairArrayIterator
```

Visual C++
---
```text
public:
virtual VertexIndexPairArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace